# SQL

## Exploration

Let's use DBeaver, a universal database client for developers, SQL programmers, database administrators and analysts.

https://dbeaver.io/

## ERD Diagram

When discovering a new database, a data scientist should explore and draw the Entity Relationship Diagram.

https://www.visual-paradigm.com/guide/data-modeling/what-is-entity-relationship-diagram/

ðŸ‘‰ Useful tool: kitt.lewagon.com/db (Save XML)

https://kitt.lewagon.com/db

https://online.visual-paradigm.com/diagrams/solutions/free-erd-tool/

https://gitmind.com/er-diagram-tool.html

## SQLite

A database stored in a single file.

ðŸ‘‰ https://www.sqlite.org/index.html

For the examples below, we use the ðŸ‘‰ European Soccer Database on Kaggle

https://www.kaggle.com/hugomathien/soccer/

### Connecting To The Database

#### Reaching for the sqlite3 package.

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('data/soccer.sqlite')
c = conn.cursor()

In [3]:
c.execute("SELECT * FROM Country")
rows = c.fetchall()
rows

[(1, 'Belgium'),
 (1729, 'England'),
 (4769, 'France'),
 (7809, 'Germany'),
 (10257, 'Italy'),
 (13274, 'Netherlands'),
 (15722, 'Poland'),
 (17642, 'Portugal'),
 (19694, 'Scotland'),
 (21518, 'Spain'),
 (24558, 'Switzerland')]

#### You can also fetch a list of sqlite3.Row elements:

https://docs.python.org/3/library/sqlite3.html#sqlite3.Row

In [3]:
conn = sqlite3.connect('data/soccer.sqlite')
conn.row_factory = sqlite3.Row
c = conn.cursor()

In [4]:
c.execute("SELECT * FROM Country")
rows = c.fetchall()
first_row = rows[0]

In [8]:
first_row['name']

'Belgium'

In [11]:
tuple(first_row)

(1, 'Belgium')

#### Fetching only one element

Sometimes you know that your query will yield only one (or zero!) element. Then use fetchone:

https://docs.python.org/3/library/sqlite3.html#sqlite3.Cursor.fetchone

In [12]:
c.execute("SELECT * FROM Country WHERE Country.id = 1")
row = c.fetchone()
print(row[0], '-' ,row[1])

1 - Belgium

In [15]:
c.execute("SELECT * FROM Country WHERE Country.id = 2")
row = c.fetchone()
print(row)

None

### SQL Basics

In [6]:
conn = sqlite3.connect('data/soccer.sqlite')
c = conn.cursor()

#### Projection

Choosing which columns the query shall return.

ðŸ¤” Retrieve id, season, stage and date of all matches

In [15]:
query = '''
    SELECT "Match".id, "Match".season, "Match".stage, "Match".date 
    FROM "Match"
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows[0:10]

Rows Returned: 25979

[(1, '2008/2009', 1, '2008-08-17 00:00:00'),
 (2, '2008/2009', 1, '2008-08-16 00:00:00'),
 (3, '2008/2009', 1, '2008-08-16 00:00:00'),
 (4, '2008/2009', 1, '2008-08-17 00:00:00'),
 (5, '2008/2009', 1, '2008-08-16 00:00:00'),
 (6, '2008/2009', 1, '2008-09-24 00:00:00'),
 (7, '2008/2009', 1, '2008-08-16 00:00:00'),
 (8, '2008/2009', 1, '2008-08-16 00:00:00'),
 (9, '2008/2009', 1, '2008-08-16 00:00:00'),
 (10, '2008/2009', 10, '2008-11-01 00:00:00')]

ðŸ’¡Tip: You can alias tables name for enhanced readability

In [16]:
query = '''
    SELECT matches.id, matches.season, matches.stage, matches.date
    FROM "Match" AS matches
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows[0:10]

Rows Returned: 25979

[(1, '2008/2009', 1, '2008-08-17 00:00:00'),
 (2, '2008/2009', 1, '2008-08-16 00:00:00'),
 (3, '2008/2009', 1, '2008-08-16 00:00:00'),
 (4, '2008/2009', 1, '2008-08-17 00:00:00'),
 (5, '2008/2009', 1, '2008-08-16 00:00:00'),
 (6, '2008/2009', 1, '2008-09-24 00:00:00'),
 (7, '2008/2009', 1, '2008-08-16 00:00:00'),
 (8, '2008/2009', 1, '2008-08-16 00:00:00'),
 (9, '2008/2009', 1, '2008-08-16 00:00:00'),
 (10, '2008/2009', 10, '2008-11-01 00:00:00')]

#### Selection

Selecting which rows the query shall return.

ðŸ¤” Retrieve matches which happened in France

In [25]:
query = '''
    SELECT matches.id, matches.season, matches.stage, matches.date, matches.country_id
    FROM "Match" AS matches
    WHERE matches.country_id = 4769
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows[0:10]

Rows Returned: 3040

[(4769, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4770, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4771, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4772, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4773, '2008/2009', 1, '2008-08-10 00:00:00', 4769),
 (4774, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4775, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4776, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4777, '2008/2009', 1, '2008-08-09 00:00:00', 4769),
 (4778, '2008/2009', 1, '2008-08-09 00:00:00', 4769)]

---

ðŸ¤” Retrieve matches which happened in Belgium or England

In [24]:
query = '''
    SELECT matches.id, matches.season, matches.stage, matches.date, matches.country_id
    FROM "Match" AS matches
    WHERE matches.country_id = 1
    OR matches.country_id = 1729
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows[0:10]

Rows Returned: 4768

[(1, '2008/2009', 1, '2008-08-17 00:00:00', 1),
 (2, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (3, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (4, '2008/2009', 1, '2008-08-17 00:00:00', 1),
 (5, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (6, '2008/2009', 1, '2008-09-24 00:00:00', 1),
 (7, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (8, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (9, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (10, '2008/2009', 10, '2008-11-01 00:00:00', 1)]

---

Alternative:

**Note: the WHERE ... IN ... list needs to be passed as a tuple!!**

In [29]:
country_ids = (1,1729)

query = f'''
    SELECT matches.id, matches.season, matches.stage, matches.date, matches.country_id
    FROM "Match" AS matches
    WHERE matches.country_id IN {country_ids}
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows[0:10]

Rows Returned: 4768

[(1, '2008/2009', 1, '2008-08-17 00:00:00', 1),
 (2, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (3, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (4, '2008/2009', 1, '2008-08-17 00:00:00', 1),
 (5, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (6, '2008/2009', 1, '2008-09-24 00:00:00', 1),
 (7, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (8, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (9, '2008/2009', 1, '2008-08-16 00:00:00', 1),
 (10, '2008/2009', 10, '2008-11-01 00:00:00', 1)]

- - -

ðŸ¤” Retrieve players named John

In [32]:
query = '''
    SELECT *
    FROM Player
    WHERE UPPER(Player.player_name) LIKE "JOHN %"
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows[0]

Rows Returned: 31

(5093,
 278831,
 'John Anthony Brooks',
 204082,
 '1993-01-28 00:00:00',
 193.04,
 172)

#### Counting

Counting the number of rows matching the selection

ðŸ¤” How many players are taller than 2.00 meters?

In [36]:
query = '''
    SELECT COUNT(Player.id)
    FROM Player
    WHERE Player.height >= 200
'''

c.execute(query)
rows = c.fetchone()

print(f'Rows Returned: {len(rows)}')

rows[0]

Rows Returned: 1

22

#### Sorting

Sorting the rows based on a column (or a group of columns)

ðŸ¤” Who are the 10 heaviest players?

In [38]:
query = '''
    SELECT *
    FROM Player
    ORDER BY Player.weight DESC
    LIMIT 10
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows[0:10]

Rows Returned: 10

[(5908,
  148325,
  'Kristof van Hout',
  185306,
  '1987-02-09 00:00:00',
  208.28,
  243),
 (10313, 27313, 'Tim Wiese', 53012, '1981-12-17 00:00:00', 193.04, 243),
 (4884, 5044, 'Jeroen Verhoeven', 137692, '1980-04-30 00:00:00', 198.12, 227),
 (4412, 27267, 'Ishmael Miller', 169725, '1987-03-05 00:00:00', 193.04, 225),
 (1598, 101584, 'Cassio', 167958, '1987-06-06 00:00:00', 195.58, 220),
 (1822, 19020, 'Christopher Samba', 46590, '1984-03-28 00:00:00', 193.04, 220),
 (5976, 210822, 'Lars Unnerstall', 199833, '1990-07-20 00:00:00', 198.12, 220),
 (6772, 30669, 'Marcus Hahnemann', 53785, '1972-06-15 00:00:00', 190.5, 220),
 (45, 40005, 'Abdoulaye Faye', 100329, '1978-02-26 00:00:00', 187.96, 218),
 (3030, 33060, 'Enoch Showunmi', 157589, '1982-04-21 00:00:00', 195.58, 218)]

#### Grouping

Grouping rows on a given column C (aggregating rows with a function where values of C column are the same)

ðŸ¤” How many matches were played on a per-country basis?

In [40]:
query = '''
    SELECT COUNT(matches.id), matches.country_id
    FROM "Match" AS matches
    GROUP BY matches.country_id
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows

Rows Returned: 11

[(1728, 1),
 (3040, 1729),
 (3040, 4769),
 (2448, 7809),
 (3017, 10257),
 (2448, 13274),
 (1920, 15722),
 (2052, 17642),
 (1824, 19694),
 (3040, 21518),
 (1422, 24558)]

---

ðŸ¤” What if we want to sort those results? We need an alias:

In [41]:
query = '''
    SELECT COUNT(matches.id) AS match_count, matches.country_id
    FROM "Match" AS matches
    GROUP BY matches.country_id
    ORDER BY match_count DESC
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows

Rows Returned: 11

[(3040, 21518),
 (3040, 4769),
 (3040, 1729),
 (3017, 10257),
 (2448, 13274),
 (2448, 7809),
 (2052, 17642),
 (1920, 15722),
 (1824, 19694),
 (1728, 1),
 (1422, 24558)]

---

ðŸ¤” How many matches were played on a per-country basis, ignoring countries with less than 3000 matches?

In [42]:
query = '''
    SELECT COUNT(matches.id) AS match_count, matches.country_id
    FROM "Match" AS matches
    GROUP BY matches.country_id
    HAVING match_count >= 3000
    ORDER BY match_count DESC
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows

Rows Returned: 4

[(3040, 21518), (3040, 4769), (3040, 1729), (3017, 10257)]

---

ðŸ¤” How many matches were

    won by the home team
    won by the away team
    finished with a draw

In [43]:
query = '''
    SELECT 
    COUNT(matches.id) AS outcome_count,
    CASE 
        WHEN matches.home_team_goal > matches.away_team_goal
            THEN 'home_win'
        WHEN matches.home_team_goal = matches.away_team_goal
            THEN 'draw'
        ELSE 'away_win'
    END AS outcome
    FROM "Match" AS matches
    GROUP BY outcome
    ORDER BY outcome_count DESC
'''

c.execute(query)
rows = c.fetchall()

print(f'Rows Returned: {len(rows)}')

rows

Rows Returned: 3

[(11917, 'home_win'), (7466, 'away_win'), (6596, 'draw')]